
## Plan Result

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7698135556)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * google_artifact_registry_repository.artifact-repository
* Replace
  * google_vpc_access_connector.internal-vpc-connector


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_vpc_access_connector.internal-vpc-connector must be replaced
-/+ resource "google_vpc_access_connector" "internal-vpc-connector" {
      ~ connected_projects = [] -> (known after apply)
      ~ id                 = "projects/gig-japan-398904/locations/asia-northeast1/connectors/vpc-connector" -> (known after apply)
      ~ machine_type       = "e2-micro" -> "f1-micro" # forces replacement
      ~ max_throughput     = 400 -> 500 # forces replacement
        name               = "vpc-connector"
      ~ network            = "int-vpc" -> "projects/gig-japan-398904/global/networks/int-vpc"
      ~ self_link          = "projects/gig-japan-398904/locations/asia-northeast1/connectors/vpc-connector" -> (known after apply)
      ~ state              = "READY" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"summary_plan","PRNumber":42,"Program":"tfcmt","SHA1":"ca3e69bce0a88a8558d6e1b5492512c18333f38c","Vars":{},"WorkflowName":"iaac_plan"} -->